In [6]:
import pandas as pd

In [7]:
# import data from csv
fpath="./students_data.csv"

In [14]:
rating = pd.read_csv(fpath)

In [16]:
rating.head(2)

    name  age   grade   course  score
0  Alice   20  Junior     Math     85
1    Bob   21  Senior  Physics     92

In [13]:
rating.shape

(7, 5)

In [17]:
print(rating.head())

      name  age      grade     course  score
0    Alice   20     Junior       Math     85
1      Bob   21     Senior    Physics     92
2  Charlie   21     Junior       Math     78
3    David   22     Senior  Chemistry     88
4     Emma   20  Sophomore    English     95

In [18]:
rating

      name  age      grade     course  score
0    Alice   20     Junior       Math     85
1      Bob   21     Senior    Physics     92
2  Charlie   21     Junior       Math     78
3    David   22     Senior  Chemistry     88
4     Emma   20  Sophomore    English     95
5    Frank   22     Senior       Math     90
6    Grace   20     Junior    Physics     83

In [19]:
print(rating)

      name  age      grade     course  score
0    Alice   20     Junior       Math     85
1      Bob   21     Senior    Physics     92
2  Charlie   21     Junior       Math     78
3    David   22     Senior  Chemistry     88
4     Emma   20  Sophomore    English     95
5    Frank   22     Senior       Math     90
6    Grace   20     Junior    Physics     83

In [20]:
rating.columns

Index(['name', 'age', 'grade', 'course', 'score'], dtype='object')

In [21]:
rating.index

RangeIndex(start=0, stop=7, step=1)

In [22]:
rating.dtypes

name      object
age        int64
grade     object
course    object
score      int64
dtype: object

In [23]:
rating['name'].isin(['Alice','Bob'])

0     True
1     True
2    False
3    False
4    False
5    False
6    False
Name: name, dtype: bool

In [24]:
rating.loc[0]

name       Alice
age           20
grade     Junior
course      Math
score         85
Name: 0, dtype: object

In [26]:
rating.loc[1]

name          Bob
age            21
grade      Senior
course    Physics
score          92
Name: 1, dtype: object

In [27]:
rating.loc[[0,1]]

    name  age   grade   course  score
0  Alice   20  Junior     Math     85
1    Bob   21  Senior  Physics     92

In [31]:
rating.loc[rating['course'] == 'Math']

      name  age   grade course  score
0    Alice   20  Junior   Math     85
2  Charlie   21  Junior   Math     78
5    Frank   22  Senior   Math     90

In [98]:
# import txt data
apath='./students_data.txt'

In [59]:
brating = pd.read_csv(apath, sep=';', header =None, names =["Name", "Age","Grade","Course","Score"],skiprows = [0])

In [60]:
brating

      Name  Age      Grade     Course  Score
0    Alice   20     Junior       Math     85
1      Bob   21     Senior    Physics     92
2  Charlie   21     Junior       Math     78
3    David   22     Senior  Chemistry     88
4     Emma   20  Sophomore    English     95
5    Frank   22     Senior       Math     90
6    Grace   20     Junior    Physics     83

In [67]:
brating.loc[(brating['Score'] > 90)]

   Name  Age      Grade   Course  Score
1   Bob   21     Senior  Physics     92
4  Emma   20  Sophomore  English     95

In [78]:
# import data from sql
from sqlalchemy import create_engine

In [80]:
sql = create_engine('sqlite:///students.db')
brating.to_sql('students', sql, if_exists='replace', index=False)

7

In [81]:
query = 'SELECT * FROM students'

In [82]:
brating_from_sql = pd.read_sql(query, sql)

In [85]:
brating_from_sql

      Name  Age      Grade     Course  Score
0    Alice   20     Junior       Math     85
1      Bob   21     Senior    Physics     92
2  Charlie   21     Junior       Math     78
3    David   22     Senior  Chemistry     88
4     Emma   20  Sophomore    English     95
5    Frank   22     Senior       Math     90
6    Grace   20     Junior    Physics     83

In [97]:
brating.loc[1]

Name          Bob
Age            21
Grade      Senior
Course    Physics
Score          92
Name: 1, dtype: object